{"pageProps":{"title":"✍️ I am not a blogger.","date":"01/11/2021","content":"<p><strong>Hello world</strong>, I am not a blogger.</p>\n<p>Nor do I claim to be! I don&#39;t spit facts, I spit what I happen to be thinking at the time. The world is big and my place in it is tiny but I do my damndest to make a difference.</p>\n<p>If you&#39;re reading this I&#39;m building the site still and I don&#39;t know how the hell you even stumbled upon it. Good for you! I&#39;m impressed by your gumption. Me? Well, I have been doing web development and software engineering and some management stuff at Livestock Nutrition Center the past couple of years.</p>\n<div style=\"text-align:center;\">\n<img src=\"/ff7.jpg\" alt=\"A scene I love from Final Fantasy 7\" width=\"85%\" style=\"border:5px solid black;\"/>\n</div>\n\n<p>I love web development but the whole reason I went to software bootcamp was to one day code my own games. That&#39;s what this site will mostly be about.I&#39;ll probably have some other sprinkling of web dev or mobile dev or whatever passing thoughts hit my thick skull. Here&#39;s to you for reading this at all :champagne emoji:</p>\n<p>My current goals are to make two or three games using Unity to list in a portfolio and link from github and itch to this site. I have done some Udemy and Unity Learn courses and am getting a feel for things. My excitement is as deep as it is wide but I am still spending time trying to learn C# as well as I know Javascript. If my mentor taught me anything, it&#39;s that clean code practices cannot be undervalued.</p>\n<div style=\"text-align:center\">\n<img src=\"/acnh.jpg\" alt=\"Happy new year from my island to yours\" width=\"85%\" style=\"border:5px solid black\"/>\n</div>\n\n<p>Additionally I&#39;m working on building a little React Native app in my spare time but that projects a secret and I&#39;ll let y&#39;all know if and when I can share anything about it <em>wink</em></p>\n<p>Happy 2021 (as happy as it can be given the pretty bleak outlook of many things)</p>\n"},"__N_SSG":true}